import re


def remove_url(input_text: str) -> str:
    """
    Видаляє всі url-адреси за такими критеріями пошуку url-адреси:
    1. Перевірка чи є на початку символ /
    2.1. Починається як окреме слово (наприклад після пробілу, нового рядка і т.д.)
    2.2. Починається на один з цих варіантів:
        http
        https
        ні на що
    2.3. Містить :// після об'єктів з 2.2.
    2.4. Або не містить все з 2.2. та 2.3.
    3. Містить щось (в необмеженій кількості) з такого можливого переліку:
        Символів у верхньому регістрі
        Символів у нижньому регістрі
        Цифр
        Знаків пунктуації (. та -)
    4. Містить крапку (.) після пункту 3
    5. Містить в кількості від 2 до 6 символів включно:
        Символів у верхньому регістрі
        Символів у нижньому регістрі
    6.1. Містить / за яким безліч символів окрім пробілу ( )
    6.2. Або не містить символи з 6.1.

    ----------------------------------------------------------------------
    Зразок: https://www.google.com/search?q=google
                            - Пункт 1. і частково 2.1.
    https://                - Пункти: 2.1. 2.2. 2.3. та 2.4.
    www.google              - Пункт 3.
    .                       - Пункт 4.
    com                     - Пункт 5.
    /search?q=google        - Пункти: 6.1. та 6.2.
    ----------------------------------------------------------------------
    """
    pattern = r"(?<!/)\b(https?://)?[a-zA-Z0-9.-]+\.[a-zA-Z]{2,6}(/\S*)?"
    return re.sub(pattern, "", input_text)

if __name__ == "__main__":
    text = ("На сайті google.com я знайшов інформацію про інші його подання як https://www.google.com/ та www.google.com. "
            "При цьому всьому google/com та htp://google.com не є дійсними сайтами")
    print(remove_url(text))
